
### Terraform Plan Summary 📜
#### Workflow Run: #13

<details>
<summary>Terraform Plan</summary>

```hcl
[command]/home/runner/work/_temp/690d0352-f3a3-4c71-880d-0febdf7703ed/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.ec2 will be created
  + resource "aws_instance" "ec2" {
      + ami                                  = "ami-005fc0f236362e99f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "devops-dojo"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "gitops"
        }
      + tags_all                             = {
          + "Name" = "gitops"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "MainIGW"
        }
      + tags_all = {
          + "Name" = "MainIGW"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.devops-dojo-keypair will be created
  + resource "aws_key_pair" "devops-dojo-keypair" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "devops-dojo"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # aws_route53_record.main_domain_record will be created
  + resource "aws_route53_record" "main_domain_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "afeezadeboye.site"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z0147908X57MCN3YH0SW"
    }

  # aws_route53_record.wildcard_domain_record will be created
  + resource "aws_route53_record" "wildcard_domain_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.afeezadeboye.site"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z0147908X57MCN3YH0SW"
    }

  # aws_route_table.rt will be created
  + resource "aws_route_table" "rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
      
... (truncated)
```

</details>

---

### Cost Estimation 💰
<details>
<summary>Infracost Breakdown</summary>

```json
{"version":"0.2","metadata":{"infracostCommand":"breakdown","vcsBranch":"infra_features","vcsCommitSha":"8931e0ee6244a3ccc0923518b325a58ac9254544","vcsCommitAuthorName":"Afeez-AA","vcsCommitAuthorEmail":"afeeadeboyee@gmail.com","vcsCommitTimestamp":"2024-12-11T12:50:36Z","vcsCommitMessage":"test","vcsRepositoryUrl":"https://github.com/Afeez-AA/automated-full-stack-gitops","vcsProvider":"github","vcsBaseBranch":"infra_main","vcsPullRequestTitle":"Terraform pull request for testing workflow","vcsPullRequestUrl":"https://github.com/Afeez-AA/automated-full-stack-gitops/pull/3","vcsPullRequestAuthor":"Afeez-AA","vcsPipelineRunId":"12277043308","vcsPullRequestId":"3"},"currency":"USD","projects":[{"name":"Afeez-AA/automated-full-stack-gitops/terraform/terraform","displayName":"","metadata":{"path":"terraform","type":"error","vcsSubPath":"terraform/terraform","errors":[{"code":106,"message":"No such file or directory terraform\n\n  Try adding a config-file to configure how Infracost should run. See https://infracost.io/config-file for details and examples.","data":null,"isError":true}]},"pastBreakdown":{"resources":[],"totalHourlyCost":"0","totalMonthlyCost":"0","totalMonthlyUsageCost":"0"},"breakdown":{"resources":[],"totalHourlyCost":"0","totalMonthlyCost":"0","totalMonthlyUsageCost":"0"},"diff":{"resources":[],"totalHourlyCost":"0","totalMonthlyCost":"0","totalMonthlyUsageCost":"0"},"summary":{"totalDetectedResources":0,"totalSupportedResources":0,"totalUnsupportedResources":0,"totalUsageBasedResources":0,"totalNoPriceResources":0,"unsupportedResourceCounts":{},"noPriceResourceCounts":{}}}],"totalHourlyCost":"0","totalMonthlyCost":"0","totalMonthlyUsageCost":"0","pastTotalHourlyCost":"0","pastTotalMonthlyCost":"0","pastTotalMonthlyUsageCost":"0","diffTotalHourlyCost":"0","diffTotalMonthlyCost":"0","diffTotalMonthlyUsageCost":"0","timeGenerated":"2024-12-11T13:10:05.05190873Z","summary":{"totalDetectedResources":0,"totalSupportedResources":0,"totalUnsupportedResources":0,"totalUsageBasedResources":0,"totalNoPriceResources":0,"unsupportedResourceCounts":{},"noPriceResourceCounts":{}}}

```

</details>

*Generated by @Afeez-AA on Workflow: "Terraform Plan with Cost Estimation"*
